app/controllers/api/benches_controller.rb

    def index
        @benches = Bench.all
---
SELECT "benches".* FROM "benches"

    def create
        @bench = Bench.new(bench_params)
        if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "nice bench"], ["lat", 37.775785], ["lng", -122.445979], ["created_at", "2019-10-03 21:21:33.357167"], ["updated_at", "2019-10-03 21:21:33.357167"]]